{
  "title": "About",
  "description": "Find out more about the origins of our flight computer and why we love cats!",
  "people": [
    {
      "name": "Luca Jost",
      "role": "Hardware & Software",
      "imageSrc": "/images/luca-cat.png",
      "imageWidth": "723",
      "imageHeight": "723",
      "backgroundColor": "#CCC"
    },
    {
      "name": "Nemanja Stojoski",
      "role": "Software & Data Handling",
      "imageSrc": "/images/nemanja-cat.png",
      "imageWidth": "964",
      "imageHeight": "964",
      "backgroundColor": "rgba(46, 133, 197, 0.3)"
    },
    {
      "name": "Jonas Binz",
      "role": "Software & Control",
      "imageSrc": "/images/jonas-cat.png",
      "imageWidth": "964",
      "imageHeight": "964",
      "backgroundColor": "rgba(244, 168, 80, 0.5)"
    }
  ],
  "sections": [
    {
      "heading": "Who Are We?",
      "paragraph": "We are a bunch of cats who have been working together for three years now on several different amateur rocket projects. In our eyes and through our experience, the commercially available sounding rocket electronics lack in many elements. This is why we founded CATS (Control and Telemetry Systems), a small company that tries to improve rocket electronics for everyone - from amateurs through student organizations to hardcore sounding rocket fans!"
    },
    {
      "heading": "Why Make Everything Open Source?",
      "paragraph": "When we started the project it was obvious to us from day one that everything needed to be open source. It brings too many advantages: the customer can adapt our product to their needs, they can contribute to the project, report bugs, and most importantly, they know exactly what they are buying."
    },
    {
      "heading": "What's Next?",
      "paragraph": "Currently we have just one board - the <a href=\"/cats-board-orion\">CATS Orion</a>. It is an advanced general-purpose flight computer that is still in development. More specifically the testing campaign of the board is not yet finished. In parallel we are working on a telemetry extension board for the CATS Orion. In the future you can expect a wide range of smaller and bigger boards that fit the needs of every rocketeer."
    },
    {
      "heading": "What's up with our Cat Obsession?",
      "paragraph": "As you may have observed on the website, we really like cats. What's not to love - they are fast, they can be loud and most importantly they always land on their paws. It's quite the same with rocketry and sounding rockets. Our flight computer makes sure that the last part is true."
    }
  ]
}
