{
  "title": "Software",
  "description": "This page describes the coolest software features of the CATS flight computer.",
  "sections": [
    {
      "heading": "Kalman Filter State Estimation",
      "paragraph": "By using acceleration and barometric data a linear Kalman filter can estimate the altitude and velocity of your rocket. The different flight states like thrusting, coasting, apogee etc. are estimated by using the filter and sensor data. Additionaly, having the accelerometer, magnetometer and gyroscope data we can estimate the orientation to a high degree of accuracy. This information can be used to determine whether to fire the second stage of two stage rocket launches or to inspect the stability of the rocket during flight.",
      "imageSrc": "/images/software/rocket.jpg",
      "imageWidth": "828",
      "imageHeight": "466"
    },
    {
      "heading": "High-speed Logging",
      "paragraph": "Every interesting flight metric and sensor data is logged with a sampling rate of 100Hz on the flash memory. If all logging elements are enabled, up to one hour of flight data can be logged. The logging starts just before liftoff and stops at touchdown. If you plan on flying longer than that you can pick and choose which metrics you want to log and its speed, thereby increasing the logging time significantly.",
      "imageSrc": "/images/software/alt-plot.png",
      "imageWidth": "1422",
      "imageHeight": "800"
    },
    {
      "heading": "Highly Configurable Settings",
      "paragraph": "The <a href=\"https://github.com/catsystems/cats-configurator/releases\">CATS Configurator</a> allows you to customize the board according to your needs. Servos, GPIOs, and pyro channels can be mapped to any flight phase. Furthermore, timers can be started at any given event and customized to trigger outputs. For more information regarding the flight phases and IOs check out our <a href=\"/downloads\">documentation</a>.",
      "imageSrc": "/images/software/configurator.png",
      "imageWidth": "2020",
      "imageHeight": "1136"
    },
    {
      "heading": "Hardware-in-the-Loop Simulations",
      "paragraph": "If you have access to simulation tools or want to check out why something did not work out as expected on a previous flight you can inject simulated or previously recorded data into the flight computer for testing. With this you can verify if your configuration, timers etc. are set correctly and feel confident that your rocket will land safely on the ground.",
      "imageSrc": "/images/software/parachute-landing.jpg",
      "imageWidth": "1656",
      "imageHeight": "931"
    }
  ]
}
